[{"Type":"Issue","Status":"Failed","URLs":993,"Hint":"URLs with duplicate h1s","Description":"URLs that have the exact same header 1 (h1) tag as at least one other indexable URL. If multiple pages have the same h1, this can make it difficult for search engines to differentiate the 'best' page for a given search query, which can result in keyword cannibalization (multiple pages on your own site competing for the same search terms, and hurting each others' rankings). ","Learn More":"https:\/\/sitebulb.com\/hints\/duplicate-content\/urls-with-duplicate-h1s\/"},{"Type":"Issue","Status":"Failed","URLs":47,"Hint":"URLs with duplicate page titles","Description":"URLs that have the exact same page title as at least one other indexable URL. If multiple pages have the same title, this can make it difficult for search engines to differentiate the 'best' page for a given search query, which can result in keyword cannibalization (multiple pages on your own site competing for the same search terms, and hurting each others' rankings). ","Learn More":"https:\/\/sitebulb.com\/hints\/duplicate-content\/urls-with-duplicate-page-titles\/"},{"Type":"Issue","Status":"Failed","URLs":27,"Hint":"URLs with duplicate meta descriptions","Description":"URLs that have the exact same meta description as at least one other indexable URL. If lots of meta descriptions are duplicate, this represents a missed optimization opportunity. It may make it difficult for users to differentiate similar pages in search results, and may result in search engines simply re-writing the descriptions for you (sometimes with disastrous results). ","Learn More":"https:\/\/sitebulb.com\/hints\/duplicate-content\/urls-with-duplicate-meta-descriptions\/"},{"Type":"Issue","Status":"Failed","URLs":2,"Hint":"URLs with duplicate title and meta descriptions","Description":"URLs that have the exact same page title and meta description as at least one other indexable URL. If multiple pages have the same title, this can make it difficult for search engines to differentiate the 'best' page for a given search query, which can result in keyword cannibalization. If a page has both a duplicate title AND a duplicate meta description, this may indicate a more systemic issue at play (than simply a copy\/paste human error). ","Learn More":"https:\/\/sitebulb.com\/hints\/duplicate-content\/urls-with-duplicate-title-and-meta-descriptions\/"},{"Type":"Issue","Status":"Failed","URLs":2,"Hint":"Duplicate URLs (technical duplicates)","Description":"URLs that are technically identical to at least one other indexable URL. This could be URLs that are only different based on case, or have the same query string parameters and values (but in a different order). If this sort of duplication occurs, you have a relatively serious issue, whereby identical URLs are being generated and are accessible to search engine crawlers. ","Learn More":"https:\/\/sitebulb.com\/hints\/duplicate-content\/technically-duplicate-urls\/"},{"Type":"Issue","Status":"Failed","URLs":2,"Hint":"URLs with duplicate content","Description":"URLs that have identical HTML content to at least one other indexable URL. If this sort of duplication occurs, you have a relatively serious issue, whereby URLs with identical content are accessible to search engine crawlers. If this results in large scale duplicate content issues on the site, you could trip quality algorithms like Google's Panda, which can depress organic search traffic to the site as a whole. ","Learn More":"https:\/\/sitebulb.com\/hints\/duplicate-content\/urls-with-duplicate-content\/"}]