[{"Type":"Issue","Status":"Failed","URLs":18,"Hint":"Contains Javascript Errors","Description":"HTML URLs that contain JavaScript errors, which could cause the HTML not to be rendered correctly. ","Learn More":null},{"Type":"Advisory","Status":"Failed","URLs":1,"Hint":"Logs messages in the browser's console","Description":"HTML URLs that contain browser console log messages. Console messages are good for debugging during development and should be removed when in the live environment. Writing to the console can be costly, especially when logging large object variables. The console object was introduced into Internet Explorer 10. All previous versions will error if the console object is called and fail to continue executing JavaScript, which could cause the HTML not to be rendered correctly. ","Learn More":null},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Document Compatibility Mode Not Set","Description":"URLs that do not have the document compatibility mode set. Internet Explorer 8\/9\/10\/11 support document compatibility modes. Setting it, allows you to control what rendering engine is used, rather Internet Explorer deciding for itself. For example, without this setting, it is possible for Internet Explorer 9 to use the Internet Explorer 6 rendering engine.","Learn More":null},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Document Compatibility Mode In <head> And Headers Differ","Description":"URLs that have the document compatibility mode is set in the <head> and the HTTP headers, and their values are different. This could lead to the incorrect mode being used, because the <head> value will be ignored as the HTTP Header takes priority.","Learn More":null},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Document Compatibility Mode Meta Position Invalid","Description":"URLs where document compatibility mode meta tag position is set too low in the <head>. The meta tag should be included before the <title> and the other <meta> tags to ensure Internet Explorer is instructed what mode to use as early as possible.","Learn More":null},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"CSS content has errors","Description":"Style Sheets that contain one or more syntax errors, which could cause the CSS rules to incorrectly parsed or ignored. ","Learn More":null},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"CSS content empty rules","Description":"Style Sheets that contain one or more empty rules. Empty rules add unnecessary bytes to the file size and although minimal, increase browser resources for rendering. ","Learn More":null},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"CSS content contains unknown CSS properties","Description":"Style Sheets that contains one or more unknown CSS properties, which will be ignored by browsers. These properties add unnecessary bytes to the file size and although minimal, increase browser resources for rendering. ","Learn More":null},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"CSS content contains duplicate CSS properties","Description":"Style Sheets that contain one or more duplicate CSS properties. These duplicate properties could be a coding error, or be in place to deal with browser support. For example, some browsers support RGBA color while others do not, so it's quite common to include both options. ","Learn More":null},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"CSS contains @import","Description":"Style Sheets that contain one or more @import at-rule, which stops of parallel downloads and increase the page render time. When the browser parses finds a @import rule, it stops and starts to download the specified file. The browser will not continue downloading any other style sheets until this @import file has finished. ","Learn More":null},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"CSS contains universal selector","Description":"Style Sheets that contain one or more universal selectors. The universal selector (*) is convenient for selecting a group of elements, but should be avoided as causes performance issues when used as the key part (far-right) of a selector. The more complex the selector containing *, the slower the evaluation becomes. ","Learn More":null},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"CSS contains unqualified attributes","Description":"Style Sheets that contain one or more unqualified attribute selectors. Unqualified attribute selectors, such as [type=text], match all elements first and then check their attributes. This means unqualified attribute selectors have the same performance characteristics as the universal selector (*). Similar to the universal selector, unqualified attribute selectors cause performance issues when used as the key part (far-right) of a selector.  ","Learn More":null},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"CSS contains zero unit declarations","Description":"Style Sheets that contain one or moreo zero unit declarations. The value of 0 works without specifying units in all situations where numbers with length units or percentages are allowed. There is no difference between 0px, 0em, 0%, or any other zero-value. The units aren't important because the value is still zero. CSS allows you to omit the length units for zero values and still remain valid CSS. It's recommended to remove units for all zero length values because these units aren't being used by the browser and therefore can be safely removed to save bytes. ","Learn More":null},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"CSS contains overqualified selectors","Description":"Style Sheets that contain one or moreo overqualified selectors. Writing selectors such as li.active are unnecessary unless the element name causes the class to behave differently. In most cases, it's safe to remove the element name from the selector, both reducing the size of the CSS as well as improving the selector performance (doesn't have to match the element anymore). Removing the element name also loosens the coupling between your CSS and your HTML, allowing you to change the element on which the class is used without also needing to update the CSS. ","Learn More":null},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"CSS contains duplicate background images","Description":"Style Sheets that contain one or more of the selectors are using the same background image. You should ensure image URLs are only used once, as duplicating them will increase the size of the Style Sheet and have a small performance hit. ","Learn More":null},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Does not contain any HTML when JavaScript is turned off","Description":"HTML URLs that do not contain any content when the JavaScript is turned off. If a user was to view this page with JavaScript disabled or a screen reader, they would be faced with a blank page. ","Learn More":null},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Missing <noscript> tag in the <body>","Description":"HTML URLs that use JavaScript, but does not include a <noscript> tag as fallback in case the user has JavaScript disabled. ","Learn More":null},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Contains duplicate element id values","Description":"HTML URLs that contain DOM elements with duplicate id attribute values. This can cause issues if the JavaScript is parsing or calling DOM elements based on these id values. Another issue is it can confuse Screen readers, as they use id values to expose a relationship between page elements. ","Learn More":null},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Contains an un-encoded special character","Description":"HTML URLs that have DOM elements with text content that contains one or more special characters, that has not been escaped\/encoded. These special characters could be incorrectly interpreted browser and cause problems when rendering the page.","Learn More":null},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Contains a broken tag","Description":"HTML URLs that have one or more HTML tags that are broken and must be paired. These could be incorrectly interpreted browser and cause problems when rendering the page.","Learn More":null},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Contains an uppercase tag name","Description":"HTML URLs that have one or more HTML tags with uppercase letters in its name. Whilst fixing this issue will not make noticeable performance gains, it is considered a best practice recommendation. Having clean, standardised code makes it easier for other developers to work on, and makes the code easier for search engine crawlers and browsers to parse.","Learn More":null},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Contains a duplicate attribute","Description":"HTML URLs that have one or more DOM elements with the same attribute is specified twice (e.g. an image with two src attributes). Browsers will use the first attribute value, and ignore subsequent attribute values. It is important these are cleaned up and fixed to ensure the correct value is used.","Learn More":null},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Contains an uppercase attribute","Description":"HTML URLs that have one or more DOM element attributes with uppercase letters in its name.  Whilst fixing this issue will not make noticeable performance gains, it is considered a best practice recommendation. Having clean, standardised code makes it easier for other developers to work on, and makes the code easier for search engine crawlers and browsers to parse. ","Learn More":null},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Contains an attribute with an unsafe character","Description":"HTML URLs that have one or more DOM elements, which uses an unsafe character, such as &, \", > and <. Such characters are considered unsafe because they make the page vulnerable to a cross-site-scripting attack (or accidentally breaking the page with innocent input).","Learn More":null},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Contains an attribute whose value is not enclosed in double quotes","Description":"HTML URLs that have one or more DOM element attribute value that is not enclosed by double quotes tags, which could result in browsers ignoring the attribute.","Learn More":null}]