[{"Type":"Issue","Status":"Failed","URLs":911,"Hint":"Has a link with no href attribute","Description":"URLs that contain at least one outgoing anchor link which has no href attribute. These type of links are often used as internal jump points, since anchor tags which have no href attribute can be used for internal anchors. However, they may also represent an error - where the hyperlink was intended but accidentally not set. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/has-a-link-with-no-href-attribute\/"},{"Type":"Advisory","Status":"Failed","URLs":320,"Hint":"Has only one followed internal linking URL","Description":"URLs that only have a followed incoming link from one other URL on the website. URLs with only a single followed incoming link only inherit a small amount of link equity, which can make ranking very difficult. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/has-only-one-followed-internal-linking-url\/"},{"Type":"Issue","Status":"Failed","URLs":110,"Hint":"URL is orphaned and was not found by the crawler","Description":"URLs that are not part of the crawlable website architecture. Orphaned URLs were not found as part of the website crawl, so were instead picked up by a different crawl source (XML Sitemap, URL List, Google Analytics or Google Search Console). The presence of orphaned URLs is not necessarily bad, however the cases you need to pay attention to are when you find orphaned URLs that return a 200 (OK) response. These are typically old URLs that need to be removed, or URLs that should be linked to, but aren't for some reason. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/url-is-orphaned-and-was-not-found-by-the-crawler\/"},{"Type":"Issue","Status":"Failed","URLs":87,"Hint":"Only receives nofollow links or links from canonicalized URLs","Description":"URLs found by the crawler that only receive incoming nofollow links, or incoming links from canonicalized URLs. In other words, the URL only receives links from URLs that do not pass Link Equity - which means that the URL has no power to rank in search results. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/only-receives-nofollow-links-or-links-from-canonicalized-urls\/"},{"Type":"Advisory","Status":"Failed","URLs":70,"Hint":"Has incoming followed links that do not use descriptive anchor text","Description":"The URL receives incoming followed links from other internal URLs, which do not use descriptive anchor text (they instead have anchor text like 'click here', go', 'here', etc...). Descriptive anchor text can help search engines and users alike to better understand your content. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/has-incoming-followed-links-that-do-not-use-descriptive-anchor-text\/"},{"Type":"Issue","Status":"Failed","URLs":52,"Hint":"Has outgoing links with malformed href data","Description":"URLs that contain at least one outgoing anchor link which has malformed href data. This means that link equity will not be passed through to the link target, as the link itself is invalid. It may also mean that crawlers are unable to find the destination URL, so crawling, indexing and ranking may all be affected. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/has-outgoing-links-with-malformed-href-data\/"},{"Type":"Issue","Status":"Failed","URLs":41,"Hint":"URL receives both follow & nofollow internal links","Description":"URLs that have a mixture of followed and nofollowed incoming links. If a given URL receives nofollowed links, this is usually a deliberate act, either because the website owner does not want to pass link equity to the linked URL, or they do not want search engines to crawl it. However, if even one other URL links to this page using followed links, this can negate the affect that the website owner was trying to achieve with the nofollow. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/url-receives-both-follow-nofollow-internal-links\/"},{"Type":"Advisory","Status":"Failed","URLs":21,"Hint":"Has one or more outgoing followed links with non descriptive anchor text","Description":"The URL contains outgoing anchor links which do not use descriptive anchor text (they instead have anchor text like 'click here', go', 'here', etc...). Descriptive anchor text can help search engines and users alike to better understand your content. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/has-one-or-more-outgoing-followed-links-with-non-descriptive-anchor-text\/"},{"Type":"Issue","Status":"Failed","URLs":4,"Hint":"Has a link with whitespace in href attribute","Description":"URLs that contain at least one outgoing anchor link which has trailing or leading whitespace character in the href attribute. Whitespace in href atrributes may cause a loss or dissipation of link equity, if search engines treat the link targets as distinct URLs. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/has-a-link-with-whitespace-in-href-attribute\/"},{"Type":"Issue","Status":"Failed","URLs":1,"Hint":"Has an internal link with no anchor text","Description":"URLs that contain at least one outgoing anchor link which has no anchor text. This represents a missed opportunity to provide additional information about the target page to search engines, which could have an impact on this page's ability to rank for relevant search queries. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/has-an-internal-link-with-no-anchor-text\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Has link with a URL referencing LocalHost or 127.0.0.1","Description":"URLs that contain at least one outgoing anchor link with a URL referencing LocalHost or 127.0.0.1. These links are normally the accidental remains of development work, and will not be publicly accessible, so site visitors and search engines will be unable to follow the link. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/has-link-with-a-url-referencing-localhost-or-127001\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Has link with a URL referencing a local or UNC file path","Description":"URLs that contain at least one outgoing anchor link with a URL referencing a local or UNC file path. These links are normally left in by accident, and will not be publicly accessible, so site visitors and search engines will be unable to follow the link. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/has-link-with-a-url-referencing-a-local-or-unc-file-path\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Has link with a URL in onclick attribute","Description":"URLs that contain at least one outgoing anchor link with a URL in an onclick attribute. This means that the link destination is JavaScript dependent, which search engines can struggle with.  ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/has-link-with-a-url-in-onclick-attribute\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Has a link with an empty href attribute","Description":"URLs that contain at least one outgoing anchor link which has an empty href attribute. This may be because a link was intended to be added, but was not. It also may represent a bug in the underlying code, which is adding <a>tags where it should not. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/has-a-link-with-an-empty-href-attribute\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Has an anchored image with no alt text","Description":"URLs that contain anchor links to image URLs with no alt text, or no alt attribute. For linked images, the alt text is considered equivalent to anchor text, and represents an opportunity to communicate meaning and context to search engines. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/has-an-anchored-image-with-no-alt-text\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Has no outgoing links","Description":"URLs that don't link to any other URL, internal or external. If you have URLs with no outgoing links, this means that they are unable to pass on link equity to other URLs within the website architecture. As such, they act link a PageRank black hole - they accumulate link equity from incoming links, but don't pass it back out to other URLs on the website. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/has-no-outgoing-links\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Pagination URL has no incoming internal links","Description":"URLs that are declared as a pagination URL, via rel=next\/prev links on another URL, but which has no incoming anchor links from internal URLs. Typically, this is a result of a misconfiguration in the website platform or CMS, which erroneously adds pagination markup and spawns pages that should not exist. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/pagination-url-has-no-incoming-internal-links\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Alternate URL has no incoming internal links","Description":"URLs that are declared as an alternate URL (on another URL), but which have no incoming anchor links from internal URLs (i.e. the only links they have are from the alternate link element). This means that the page cannot accumulate PageRank and will have no ability to rank in the search results. This Hint is Advisory since there are plenty of common situations where it is deliberate for alternate URLs to not be a part of the 'user-facing' website structure. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/alternate-url-has-no-incoming-internal-links\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Has link to a non-HTTP protocol","Description":"The URL contains outgoing anchor links which use a non-HTTP protocol (e.g. link to ftp:\/\/example.com\/page). If you have links with a non-HTTP protocol, there is no guarantee how they would be handled by the user's browser. For example, using the FTP protocol in a HTML link will cause the link to be opened by the users' default FTP client. ","Learn More":"https:\/\/sitebulb.com\/hints\/links\/has-link-to-a-non-http-protocol\/"}]