[{"URL":"https:\/\/www.mdmountainside.com\/blog\/allegany-county-ice-cream-trail","Meta Description":"We may be located in the breezy mountains of Mountain Maryland, but that doesn’t spare us from the sultry dog days of summer. Whether you’re biking through Allegany County on the Great Allegheny Passage or just want a sweet retreat from the mountain’s summer sun, Allegany County, Maryland, is home to some notable ice cream stops.","Meta Description Length":331,"No. Meta Descriptions":1,"Indexable":"Yes","Indexable Status":"Indexable"},{"URL":"https:\/\/www.mdmountainside.com\/blog\/cumberland-historic-walking-tour","Meta Description":"Journey through this historic and architectural walking tour of downtown Cumberland, MD, to learn how the success of Chesapeake and Ohio Canal and the Baltimore and Ohio Railroad drove the need and desire to construct buildings that conveyed the city’s importance and sophistication.","Meta Description Length":283,"No. Meta Descriptions":1,"Indexable":"Yes","Indexable Status":"Indexable"},{"URL":"https:\/\/www.mdmountainside.com\/blog\/plan-for-vacation-day","Meta Description":"Plan For Vacation Day is here, January 30, 2018. While we know you are daydreaming about your next getaway, have you actually started planning? If not, let us help you narrow down the choice for your next mountain escape - choose Allegany County, Maryland's Mountain Maryland!","Meta Description Length":276,"No. Meta Descriptions":1,"Indexable":"Yes","Indexable Status":"Indexable"},{"URL":"https:\/\/www.mdmountainside.com\/mountain-maryland-photo-contest-2019","Meta Description":"Allegany County Tourism invites visitors and community members to celebrate our region’s story with the second annual 2019 Mountain Maryland Photo Contest. Photos will be collected in four categories that represent Allegany County Tourism’s four pillars of success: Arts and Entertainment, History and Heritage, Nature and Scenic Landscapes, and Outdoor Recreation. Qualifying photo submissions will be eligible for $1,700 in cash prizes between the four categories.","Meta Description Length":466,"No. Meta Descriptions":1,"Indexable":"Yes","Indexable Status":"Indexable"},{"URL":"https:\/\/www.mdmountainside.com\/news-mountain-maryland-marketing-and-tourism-summit-launches-in-allegany-county-maryland","Meta Description":"The Mountain Maryland Marketing and Tourism Summit is a one-day conference intends to be a business development opportunity, featuring industry leaders covering topics on social media, digital marketing, customer service, and more.","Meta Description Length":231,"No. Meta Descriptions":1,"Indexable":"Yes","Indexable Status":"Indexable"},{"URL":"https:\/\/www.mdmountainside.com\/partners\/tourism-reinvestment-marketing-grant-program","Meta Description":"The Tourism Reinvestment Marketing Grant Program is open to nonprofits conducting tourism marketing activities in Allegany County, Maryland, and is made possible through the collection of Hotel and Motel tax from the county's lodging partners.","Meta Description Length":243,"No. Meta Descriptions":1,"Indexable":"Yes","Indexable Status":"Indexable"},{"URL":"https:\/\/www.mdmountainside.com\/tourism-grant-2019","Meta Description":"Allegany County Tourism is seeking applications for qualified tourism marketing and promotion focused projects through the newly launched Tourism Reinvestment Marketing Grant. The Tourism Reinvestment Marketing grant is made possible through the Hotel\/Motel Tax collection through Allegany County, Maryland, lodging partners. A total of $25,000 has been allocated towards this new grant program for the fiscal year 2020, July 1, 2019 – June 30, 2020.","Meta Description Length":450,"No. Meta Descriptions":1,"Indexable":"Yes","Indexable Status":"Indexable"}]