[{"Type":"Issue","Status":"Failed","URLs":198,"Hint":"Total page size too big for 3G connections","Description":"URLs for which the total byte size of the page and all the resources is greater than 1600KB, which is theoretically too big for a time-to-interactive of 10 seconds on a 3G connection. This means that the page is very slow loading on mobile, which negatively affects user experience. ","Learn More":"https:\/\/sitebulb.com\/hints\/mobile-friendly\/total-page-size-too-big-for-3g-connections\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Multiple viewport <meta> tags were found in the <head>","Description":"URLs that contain multiple viewport <meta> tags in the <head>. Only one viewport tag is required, and if more than one is used this could lead to the wrong one being selected, which may cause rendering issues. ","Learn More":"https:\/\/sitebulb.com\/hints\/mobile-friendly\/multiple-viewport-meta-tags-were-found-in-the-head\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Missing viewport <meta> tag in the <head>","Description":"URLs that do not contain the viewport <meta> tag in the <head>. Without a viewport, mobile devices will render the page at a typical desktop screen width, scaled to fit the screen. ","Learn More":"https:\/\/sitebulb.com\/hints\/mobile-friendly\/missing-viewport-meta-tag-in-the-head\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"The viewport <meta> tag has scaling issues","Description":"URLs for which the viewport <meta> tag is not set up correctly for scaling. You can use the meta viewport tag to control the width and scaling of the browser's viewport: include 'width=device-width' to match the screen's width in device-independent pixels, include 'initial-scale=1' to establish a 1:1 relationship between CSS pixels and device-independent pixels, and ensure the page is accessible by not disabling user scaling. ","Learn More":null},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"The viewport <meta> tag does not have a width set","Description":"URLs for which the viewport <meta> tag does not have a width set. You can control the page dimensions on different devices by including 'width=device-width', which matches the screen's width in device-independent pixels. If you don't set the width, mobile browsers will render the page at a desktop screen width, and then try to make the content look better by increasing font sizes and scaling the content to fit the screen, which means that font sizes may appear inconsistent to users, who may have to double-tap or pinch-to-zoom in order to see and interact with the content. ","Learn More":"https:\/\/sitebulb.com\/hints\/mobile-friendly\/the-viewport-meta-tag-does-not-have-a-width-set\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"The viewport <meta> tag has a specific width set","Description":"URLs for which the viewport <meta> tag has a specific width set. You can control the page dimensions on different devices by including 'width=device-width', which matches the screen's width in device-independent pixels. If you set a specific width, mobile browsers will render the page at the width even on devices that are larger or smaller, and then try to make the content look better by increasing font sizes and scaling the content to fit the screen, which means that font sizes may appear inconsistent to users, who may have to double-tap or pinch-to-zoom in order to see and interact with the content. ","Learn More":"https:\/\/sitebulb.com\/hints\/mobile-friendly\/the-viewport-meta-tag-has-a-specific-width-set\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"The viewport <meta> tag is missing an initial-scale","Description":"URLs for which the viewport <meta> tag is missing an initial-scale. Some browsers keep the page's width constant when rotating to landscape mode, and zoom rather than reflow to fill the screen. Adding the attribute 'initial-scale=1' instructs browsers to establish a 1:1 relationship between CSS pixels and device-independent pixels regardless of device orientation, and allows the page to take advantage of the full landscape width. ","Learn More":"https:\/\/sitebulb.com\/hints\/mobile-friendly\/the-viewport-meta-tag-is-missing-an-initial-scale\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"The viewport <meta> tag initial-scale is incorrect","Description":"URLs for which the viewport <meta> tag initial-scale is not set to 1. Adding the attribute 'initial-scale=1' instructs browsers to establish a 1:1 relationship between CSS pixels and device-independent pixels regardless of device orientation, and allows the page to take advantage of the full landscape width when rotating the screen. Unless the width attribute is set to a specific value, setting the initial-scale to a value other than 1 will make the page content appear zoomed in (or out) on mobile devices. ","Learn More":"https:\/\/sitebulb.com\/hints\/mobile-friendly\/the-viewport-meta-tag-initial-scale-is-incorrect\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"The viewport <meta> tag prevents the user from scaling","Description":"URLs for which the viewport <meta> tag has a user-scale value that prevents the user from scaling. This means that the attribute 'user-scalable' is set to '0' or 'no', which essentially disables user scaling, meaning that users cannot zoom in\/out on mobile devices, and may cause accessibility issues. ","Learn More":"https:\/\/sitebulb.com\/hints\/mobile-friendly\/the-viewport-meta-tag-prevents-the-user-from-scaling\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"The viewport <meta> tag has a maximum-scale set","Description":"URLs for which the viewport <meta> tag has a maximum-scale value. Setting a value for the 'maximum-scale' attribute could prevent the user from scaling properly, meaning that users may not be able to zoom in\/out on mobile devices, and may cause accessibility issues. ","Learn More":"https:\/\/sitebulb.com\/hints\/mobile-friendly\/the-viewport-meta-tag-has-a-maximum-scale-set\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"The viewport <meta> tag has a minimum-scale set","Description":"URLs for which the viewport <meta> tag has a minimum-scale value. Setting a value for the 'minimum-scale' attribute could prevent the user from scaling properly, meaning that users may not be able to zoom in\/out on mobile devices, and may cause accessibility issues. ","Learn More":"https:\/\/sitebulb.com\/hints\/mobile-friendly\/the-viewport-meta-tag-has-a-minimum-scale-set\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Font size is too small for mobile devices","Description":"URLs that contain some text which is too small, and not legible for mobile devices. It is recommended to use a base font size of 12 CSS pixels on the <body> or <html> tag, anything smaller is considered illegible. ","Learn More":"https:\/\/sitebulb.com\/hints\/mobile-friendly\/font-size-is-too-small-for-mobile-devices\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Content does not size correctly to viewport","Description":"URLs for which the page content is not responsive. When the screen is made smaller or larger than viewport width, the content does not size accordingly, which often means that the page is not optimized for mobile devices. ","Learn More":"https:\/\/sitebulb.com\/hints\/mobile-friendly\/content-does-not-size-correctly-to-viewport\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Tap targets are too small or close","Description":"URLs that contain touch targets (such as buttons and links) which are too small or close to each other. This makes it difficult for mobile users to tap a desired element with their finger without also tapping a neighboring element. The minimum recommended touch target size is around 48 pixels on a page that has a mobile viewport set. Smaller touch targets should be spaced about 32 pixels apart, both horizontally and vertically. ","Learn More":"https:\/\/sitebulb.com\/hints\/mobile-friendly\/tap-targets-are-too-small-and-close\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Has one or more image-map <map> tags","Description":"URLs that contain image-map tags. Image maps rely on hard coded coordinate data for each different link, which do not scale well in mobile browsers. ","Learn More":"https:\/\/sitebulb.com\/hints\/mobile-friendly\/has-one-or-more-image-map-map-tags\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Unsupported browser plugins found","Description":"URLs that utilize unsupported browser plugins. Plugins are not widely supported by mobile devices (and by default most desktop browsers restrict them), which makes the content unavailable on mobile devices. ","Learn More":"https:\/\/sitebulb.com\/hints\/mobile-friendly\/unsupported-browser-plugins-found\/"}]