[{"Type":"Advisory","Status":"Failed","URLs":1140,"Hint":"URL contains a form with a GET method","Description":"URLs that contain a form element with the method set to GET, which creates submission URLs with the form data in the query string. This presents a potential vulnerability for a large number of URLs to be created and\/or cached, which could cause issues with crawl efficiency or index bloat ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/html-hints\/url-contains-a-form-with-a-get-method\/"},{"Type":"Advisory","Status":"Failed","URLs":1069,"Hint":"Title tag length too long","Description":"URLs that contain a title tag with too many characters. If the title uses too many characters, it may not be well optimized to effectively communicate the desired message. Depending on the query, search engines may truncate or rewrite titles that are too long. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/title-tag-length-too-long\/"},{"Type":"Advisory","Status":"Failed","URLs":1035,"Hint":"Meta description length too short","Description":"URLs that contain a meta description with too few characters. If the meta description is particularly short, this may mean it has been automatically generated or is not well optimized, and may achieve poor click-through-rate as a result. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/meta-description-length-too-short\/"},{"Type":"Advisory","Status":"Failed","URLs":810,"Hint":"Meta description is empty","Description":"URLs that have an empty meta description. The meta description is considered important to help users quickly understand what content they can expect to find on the page, when clicking through from the search engine results page. Well written meta descriptions typically achieve a better click-through-rate. If the meta description is empty, this represents a missed optimization opportunity. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/meta-description-is-empty\/"},{"Type":"Advisory","Status":"Failed","URLs":188,"Hint":"Multiple <h1> tags","Description":"URLs that contain multiple header 1s. Having more than one <h1> tag can be a sign of poor content structure, and could de-emphasize keyword associations with the page. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/multiple-h1-tags\/"},{"Type":"Advisory","Status":"Failed","URLs":7,"Hint":"Meta description length too long","Description":"URLs that contain a meta description with too many characters. If the meta description is very long, this may mean it has been automatically generated or is not well optimized, and may achieve poor click-through-rate as a result. Depending on the query, search engines may truncate or rewrite meta descriptions that are too long. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/meta-description-length-too-long\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"<head> contains a <noscript> tag","Description":"URLs where the <head> contains a <noscript> tag. You need to be very careful using <noscript> tags in the <head>, as you can very easily break the <head>, which can cause problems for search engines as they may be unable to find important head-only tags, such as hreflang. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/html-hints\/head-contains-a-noscript-tag\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"<head> contains a <noscript> tag, which includes an image","Description":"URLs where the <head> contains a <noscript> tag, which includes an image. Including an <img> tag in the <head> is invalid. This can be problematic for search engines crawlers that do not render JavaScript (i.e. most crawlers, most of the time), as the presence of the <img> tag breaks the <head>, which may cause important tags (e.g. meta robots) to be missed. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/html-hints\/head-contains-a-noscript-tag-which-includes-an-image\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"<head> contains invalid HTML elements","Description":"URLs where the <head> contains invalid DOM elements. Valid elements that can be used inside the <head> element are <title>, <meta>, <base>, <link>, <script>, <noscript>, <style> and <template>. Including invalid elements can lead to the HTML document not being parsed correctly, as the presence of other elements breaks the <head>, which may cause important tags (e.g. meta robots) to be missed. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/html-hints\/head-contains-invalid-html-elements\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"HTML is missing or empty","Description":"URLs do not contain any HTML. If there is no HTML content, then users and search engines alike will not be able to access any visible content. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/html-hints\/html-is-missing-or-empty\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"<h1> tag is missing","Description":"HTML URLs that do not contain a header 1. The header 1 (h1) tag is considered important to help both users and search engines to quickly understand what content they can expect to find on the page. If the <h1> is not present, this represents a missed optimization opportunity. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/h1-tag-is-missing\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"<h1> tag is empty","Description":"HTML URLs that have an empty header 1. The header 1 (h1) tag is considered important to help both users and search engines to quickly understand what content they can expect to find on the page. If the <h1> is empty, this represents a missed optimization opportunity. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/h1-tag-is-empty\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Base URL malformed or empty","Description":"URLs that specify a base URL which is malformed or empty. The base tag is used to determine the URL base for all relative links used within a page. If the base tag is malformed or empty, this may cause problems for search engines crawling relative links. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/html-hints\/base-url-malformed-or-empty\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Meta description is missing","Description":"URLs that do not contain a meta description. The meta description is considered important to help users quickly understand what content they can expect to find on the page, when clicking through from the search engine results page. Well written meta descriptions typically achieve a better click-through-rate. If the meta description is missing, this represents a missed optimization opportunity. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/meta-description-is-missing\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Multiple base URLs","Description":"URLs that specify more than one base URL. The base tag is used to determine the URL base for all relative links used within a page. A document can have no more than one base element, so multiple base tags is invalid, and this may cause problems for search engines crawling relative links. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/html-hints\/multiple-base-urls\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Multiple meta descriptions","Description":"URLs that contain multiple meta descriptions. If there are multiple meta descriptions on the page, it may lead to search engines displaying the 'wrong' one, which in turn may lead to lower engagement or CTR from search results. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/multiple-meta-descriptions\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Multiple title tags","Description":"URLs that contain more than one <title> element. If there are multiple title tags on the page, it may lead to search engines displaying the 'wrong' one, which in turn may lead to lower engagement or CTR from search results, and may also have an SEO impact. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/multiple-title-tags\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Multiple, mismatched base URLs","Description":"URLs that specify more than one base URL, and the URLs are different. The base tag is used to determine the URL base for all relative links used within a page. A document can have no more than one base element, so multiple base tags is invalid, and this may cause problems for search engines crawling relative links - particularly as the base URLs are different, there is no guarantee they will select the 'right' one. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/html-hints\/multiple-mismatched-base-urls\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"<h1> length too long","Description":"URLs that contain a header 1 with too many words. If the <h1> uses too many words, in may not be well optimized to effectively communicate the desired message. It is considered best practice to try and include the main target keywords for the page in the <h1>, whilst also communicating 'what the page is about.' ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/h1-length-too-long\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"<h1> length too short","Description":"URLs that contain a header 1 with too few words. If the <h1> does not use many words, in may not be well optimized to effectively communicate the desired message. It is considered best practice to try and include the main target keywords for the page in the <h1>, whilst also communicating 'what the page is about.' ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/h1-length-too-short\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Title and meta description are the same","Description":"URLs that have identical text for the title and meta description. The title and meta description serve very different purposes, and if they are identical then this is usually the result of a misconfigured plugin or script. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/title-and-meta-description-are-the-same\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Title tag is missing","Description":"HTML URLs that do not contain the <title> element. The title tag is considered one of the most important on-page SEO factors, so if it is missing this represents an issue that may affect search engine rankings and click-through-rate from the search results. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/title-tag-is-missing\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Title tag is empty","Description":"HTML URLs that contain an empty <title> element. The title tag is considered one of the most important on-page SEO factors, so if it is not present this represents an issue that may affect search engine rankings and click-through-rate from the search results. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/title-tag-is-empty\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Title tag length too short","Description":"URLs that contain a title tag with too few characters. If the title uses too few characters, it may not be sufficient to effectively communicate the desired message. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/title-tag-length-too-short\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"URL contains more than one Google Analytics code","Description":"URLs that contain multiple Google Analytics codes. Whilst valid, and sometimes deliberate, this might imply a configuration error - such as a plugin inserting an additional code. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/html-hints\/url-contains-more-than-one-google-analytics-code\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"URL contains more than one Google Tag Manager code","Description":"URLs that contain multiple Google Tag Manager codes. Whilst it is valid, Google advise to keep the number of Google Tag Manager containers on the page minimal, for best performance. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/html-hints\/url-contains-more-than-one-google-tag-manager-code\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"URL contains no Google Analytics code","Description":"URLs that do not contain a Google Analytics code. This may simply be because the website does not use Google Analytics, but may also represent instances where the Google Analytics code is accidentally missing. Note that this Hint is independent of any Google Tag Manager implementation, and simply means that no Google Analytics code was found on the page. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/html-hints\/url-contains-no-google-analytics-code\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"URL contains no Google Tag Manager code","Description":"URLs that do not contain a Google Tag Manager code. This may simply be because the website does not use Google Tag Manager, but may also represent instances where the Google Tag Manager code is accidentally missing. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/html-hints\/url-contains-no-google-tag-manager-code\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Has images with missing alt text","Description":"URLs that contain images with no alt attribute or missing alt text. Alt text is important for accessibility, to communicate meaning and context about the image to visually impaired users. Search engines also use alt text to understand the meaning and context, so images with no alt text represent poor accessibility, and a missed SEO opportunity. ","Learn More":"https:\/\/sitebulb.com\/hints\/on-page\/seo-hints\/has-images-with-missing-alt-text\/"}]