[{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Mismatched nofollow directives in HTML and header","Description":"URLs with the robots follow\/nofollow directive specified in both the HTML <head> and also in the X-Robots-Tag, where the directives do not match. This means that one location uses 'follow' and the other uses 'nofollow', and net result of this is that search engines will consider the page 'nofollow'. This may cause crawling and indexing issues on important pages. ","Learn More":"https:\/\/sitebulb.com\/hints\/indexability\/robots-hints\/mismatched-nofollow-directives-in-html-and-header\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Mismatched noindex directives in HTML and header","Description":"URLs with the robots index\/noindex directive specified in both the HTML <head> and also in the X-Robots-Tag, where the directives do not match. This means that one location uses 'index' and the other uses 'noindex', and net result of this is that search engines will consider the page 'noindex', which may cause important pages to end up not indexed. ","Learn More":"https:\/\/sitebulb.com\/hints\/indexability\/robots-hints\/mismatched-noindex-directives-in-html-and-header\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Multiple nofollow directives","Description":"URLs with the robots nofollow directive specified in more than one location (e.g. two SEO plugins that both add robots directives to the HTML). It is considered best practice to only specify robots directives once on any given URL, as this helps avoid potential issues in the future. ","Learn More":"https:\/\/sitebulb.com\/hints\/indexability\/robots-hints\/multiple-nofollow-directives\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Multiple noindex directives","Description":"URLs with the robots noindex directive specified in more than one location (e.g. two SEO plugins that both add robots directives to the HTML).It is considered best practice to only specify robots directives once on any given URL, as this helps avoid potential issues in the future. ","Learn More":"https:\/\/sitebulb.com\/hints\/indexability\/robots-hints\/multiple-noindex-directives\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Nofollow in HTML and HTTP header","Description":"URLs with the robots nofollow directive specified in both the HTML <head> and also in the X-Robots-Tag. It is considered best practice to only specify robots directives once on any given URL, as this helps avoid potential issues in the future. ","Learn More":"https:\/\/sitebulb.com\/hints\/indexability\/robots-hints\/nofollow-in-html-and-http-header\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Noindex in HTML and HTTP header","Description":"URLs with the robots noindex directive specified in both the HTML <head> and also in the X-Robots-Tag. It is considered best practice to only specify robots directives once on any given URL, as this helps avoid potential issues in the future. ","Learn More":"https:\/\/sitebulb.com\/hints\/indexability\/robots-hints\/noindex-in-html-and-http-header\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Disallowed image","Description":"Image URLs that are disallowed in robots.txt, which may affect how search engines render page content. If these page resource URLs are disallowed in robots.txt, it means that Googlebot may be unable to correctly render the page content. Google relies on rendering in a number of their algorithms - most notably the 'mobile friendly' one - so if content cannot be properly rendered, this could have a knock on effect in terms of search engine rankings. ","Learn More":"https:\/\/sitebulb.com\/hints\/indexability\/robots-hints\/disallowed-image\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Disallowed JavaScript file","Description":"JavaScript files that are disallowed in robots.txt, which may affect how search engines render page content. If these page resource URLs are disallowed in robots.txt, it means that Googlebot may be unable to correctly render the page content. Google relies on rendering in a number of their algorithms - most notably the 'mobile friendly' one - so if content cannot be properly rendered, this could have a knock on effect in terms of search engine rankings. ","Learn More":"https:\/\/sitebulb.com\/hints\/indexability\/robots-hints\/disallowed-javascript-file\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Disallowed Style Sheet","Description":"CSS files that are disallowed in robots.txt, which may affect how search engines render page content. If these page resource URLs are disallowed in robots.txt, it means that Googlebot may be unable to correctly render the page content. Google relies on rendering in a number of their algorithms - most notably the 'mobile friendly' one - so if content cannot be properly rendered, this could have a knock on effect in terms of search engine rankings. ","Learn More":"https:\/\/sitebulb.com\/hints\/indexability\/robots-hints\/disallowed-style-sheet\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Has noindex and nofollow directives","Description":"Internal URLs with both the noindex and nofollow robots directives. This means that search engines are being instructed not to include the URL in their index, and to not schedule and crawl any of the links found on the pages. This Hint is Advisory since using these type of robots directives is a common way to control what content search engines can crawl and index (e.g. a user login area). However it is worth double checking that there are no URLs using these directives that you actually want to be properly crawled and indexed. ","Learn More":"https:\/\/sitebulb.com\/hints\/indexability\/robots-hints\/has-noindex-and-nofollow-directives\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Internal Disallowed URLs","Description":"Internal URLs that are disallowed in robots.txt. Disallowed URLs are not crawlable by search engines, which means that content from disallowed pages is not indexable. This Hint is Advisory since disallowing URLs is a common method for managing search engine crawlers, so they do not end up crawling areas of a website that you don't want them to crawl (e.g. a user login area). However it is worth double checking that there are no URLs that are being disallowed which should not be disallowed. ","Learn More":"https:\/\/sitebulb.com\/hints\/indexability\/robots-hints\/internal-disallowed-urls\/"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"URL only has nofollow incoming internal links","Description":"URLs that do not have any followed internal links pointing at them - only nofollow links. If a given URL receives only nofollow links from all the internal URLs that link to it, that means it will no accumulate link equity, and as such would have no power to rank for search queries. This Hint is Advisory since, in some cases, it is entirely appropriate for a URL to have only nofollow links pointing at it (e.g. a user login page). However it is worth double checking that there are no such URLs that you actually want to be properly crawled and indexed. ","Learn More":"https:\/\/sitebulb.com\/hints\/indexability\/robots-hints\/url-only-has-nofollow-incoming-internal-links\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Meta robots found outside of <head>","Description":"URLs that have a meta robots tag in the HTML which has been placed outside the <head>. Meta robots tags are supposed to only be contained in the <head>, but even if they are found in the <body> they will be respected by search engines, despite what you might expect. This may mean you are giving conflicting or inaccurate indexing signals to search engines, without realising it. ","Learn More":"https:\/\/sitebulb.com\/hints\/indexability\/robots-hints\/meta-robots-found-outside-of-head\/"}]