[{"Type":"Advisory","Status":"Failed","URLs":1140,"Hint":"Content-Security-Policy HTTP header is missing or invalid","Description":"A Content Security Policy is an effective measure to protect your site from XSS attacks. By whitelisting sources of approved content, you can prevent the browser from loading malicious assets.","Learn More":"https:\/\/scotthelme.co.uk\/content-security-policy-an-introduction\/"},{"Type":"Issue","Status":"Failed","URLs":1140,"Hint":"Loads page resources using protocol relative URIs","Description":"Loading a resource using protocol relative URIs allow it to be requested over HTTP and opens the door for Man-on-the-side attacks. If a resource is available over SSL, then always use the https:\/\/ URI. ","Learn More":"https:\/\/sitebulb.com\/hints\/security\/loads-page-resources-using-protocol-relative-uris\/"},{"Type":"Issue","Status":"Failed","URLs":1140,"Hint":"Has external opener links vulnerable to tabnapping","Description":"Contains links to external URLs that use target='_blank' to open a new tab\/window. The browser opens a new tab for the link, but also, for a very brief moment, allows the new tab to communicate with the original tab using a browser feature called the window.opener API. An attacker can place malicious code on the newly opened website, check the source of the click, and force the original tab to open a new URL.","Learn More":"https:\/\/www.jitbit.com\/alexblog\/256-targetblank---the-most-underestimated-vulnerability-ever\/"},{"Type":"Issue","Status":"Failed","URLs":1140,"Hint":"Has style sheets served via a CDN without subresource integrity","Description":"A CDN is in control of some or all of the style sheets on this URL, which means a third-party could make unwanted changes to the script. Using a specification called Subresource Integrity, a website can include CSS that will stop working if it has been modified.","Learn More":"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/Security\/Subresource_Integrity"},{"Type":"Issue","Status":"Failed","URLs":1140,"Hint":"Has JavaScript served via a CDN without subresource integrity","Description":"A CDN is in control of some or all of the JavaScript files on this URL, which means a third-party could make unwanted changes to the script. Using a specification called Subresource Integrity, a website can include JavaScript that will stop working if it has been modified.","Learn More":"https:\/\/developer.mozilla.org\/en-US\/docs\/Web\/Security\/Subresource_Integrity"},{"Type":"Advisory","Status":"Failed","URLs":4,"Hint":"HTTPS URL links to an HTTP URL","Description":"HTTPS URLs that contain one or more outgoing internal links to URLs which are HTTP. ","Learn More":"https:\/\/sitebulb.com\/hints\/security\/https-url-links-to-an-http-url\/"},{"Type":"Advisory","Status":"Failed","URLs":4,"Hint":"Strict-Transport-Security HTTP (HSTS) header is missing","Description":"HTTP Strict Transport Security (HSTS) strengthens your implementation of TLS by getting the User Agent to enforce the use of HTTPS.","Learn More":"https:\/\/scotthelme.co.uk\/hsts-the-missing-link-in-tls\/"},{"Type":"Advisory","Status":"Failed","URLs":4,"Hint":"Referrer-Policy HTTP header is missing","Description":"Referrer Policy is a new header that allows a site to control how much information the browser includes with navigations away from a document and should be set by all sites.","Learn More":"https:\/\/scotthelme.co.uk\/a-new-security-header-referrer-policy\/"},{"Type":"Advisory","Status":"Failed","URLs":4,"Hint":"X-Content-Type-Options HTTP header is missing","Description":"X-Content-Type-Options stops a browser from trying to MIME-sniff the content type and forces it to stick with the declared content-type. The only valid value for this header is \"X-Content-Type-Options: nosniff\".","Learn More":"https:\/\/scotthelme.co.uk\/hardening-your-http-response-headers\/#x-content-type-options"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"HTTP URL contains a password input field","Description":"URLs that are using an unsecure HTTP protocol and contain a form that posts potentially sensitive password data. ","Learn More":"https:\/\/sitebulb.com\/hints\/security\/http-url-contains-a-password-input-field\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Mixed content (loads HTTP resources on HTTPS URL)","Description":"URLs that are loaded over a secure HTTPS connection, with some resources that are loaded over an unsecure HTTP connection (mixed content). ","Learn More":"https:\/\/sitebulb.com\/hints\/security\/mixed-content-loads-http-resources-on-https-url\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"HTTPS URL contains a form posting to HTTP","Description":"HTTPS URLs that contain a form which posts to HTTP (protocol change). ","Learn More":"https:\/\/sitebulb.com\/hints\/security\/https-url-contains-a-form-posting-to-http\/"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"X-Frame-Options HTTP header is missing or invalid","Description":"X-Frame-Options tells the browser whether you want to allow your site to be framed or not. By preventing a browser from framing your site you can defend against attacks like clickjacking. Recommended value \"x-frame-options: SAMEORIGIN\".","Learn More":"https:\/\/scotthelme.co.uk\/hardening-your-http-response-headers\/#x-frame-options"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"X-XSS-Protection HTTP header is missing or invalid","Description":"X-XSS-Protection sets the configuration for the cross-site scripting filter built into most browsers. Recommended value \"X-XSS-Protection: 1; mode=block\".","Learn More":"https:\/\/scotthelme.co.uk\/hardening-your-http-response-headers\/#x-xss-protection"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Has deprecated Public-Key-Pins HTTP header","Description":"The Public-Key-Pins header has limited support and is being deprecated. It is also easily create a lot of problems with this header is not set up correctly.","Learn More":"https:\/\/groups.google.com\/a\/chromium.org\/forum\/#!msg\/blink-dev\/he9tr7p3rZ8\/eNMwKPmUBAAJ"},{"Type":"Issue","Status":"Pass","URLs":0,"Hint":"Has deprecated Public-Key-Pins-Report-Only HTTP header","Description":"The Public-Key-Pins-Report-Only header has limited support and is being deprecated. It is also easily create a lot of problems if this header is not set up correctly.","Learn More":"https:\/\/groups.google.com\/a\/chromium.org\/forum\/#!msg\/blink-dev\/he9tr7p3rZ8\/eNMwKPmUBAAJ"},{"Type":"Advisory","Status":"Pass","URLs":0,"Hint":"Leaks server information useful for compromising servers","Description":"Servers will commonly reveal what software is running on them, what versions of the software are on there and what frameworks are powering it. Reducing the amount of information you divulge is always a benefit.","Learn More":"https:\/\/scotthelme.co.uk\/hardening-your-http-response-headers\/#server"}]